Ran Plan for dir: `terraform/cloudfront` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_ssm_parameter.certificate_arn: Reading...
data.aws_lb.frontend_prod: Reading...
data.aws_lb.frontend_stage: Reading...
data.aws_ssm_parameter.route53_zone_id: Reading...
data.aws_lb.gateway: Reading...
data.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/shared/network/route53-zone-id]
data.aws_ssm_parameter.certificate_arn: Read complete after 0s [id=/shared/network/certificate-arn]
data.aws_lb.gateway: Read complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/gateway-alb-prod/09b90e55b9014192]
data.aws_lb.frontend_prod: Read complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/turbo-setof-web-lb/511471b72d415a14]
data.aws_lb.frontend_stage: Read complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/turbo-setof-web-stage/e86cf1b620a13a5f]
data.aws_acm_certificate.cloudfront_cert: Reading...
data.aws_acm_certificate.cloudfront_cert: Read complete after 2s [id=arn:aws:acm:us-east-1:646886795421:certificate/24ad1686-0eb5-4ef0-9469-21cfb8cf683f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_cloudfront_cache_policy.api_no_cache will be created
+ resource "aws_cloudfront_cache_policy" "api_no_cache" {
      + arn         = (known after apply)
      + comment     = "No caching for API requests - forward all to origin"
      + default_ttl = 0
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 0
      + min_ttl     = 0
      + name        = "gateway-api-no-cache-prod"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + cookies_config {
              + cookie_behavior = "all"
            }
          + headers_config {
              + header_behavior = "whitelist"

              + headers {
                  + items = [
                      + "Accept",
                      + "Accept-Language",
                      + "Authorization",
                      + "Content-Type",
                      + "Host",
                      + "Origin",
                    ]
                }
            }
          + query_strings_config {
              + query_string_behavior = "all"
            }
        }
    }

  # aws_cloudfront_distribution.prod will be created
+ resource "aws_cloudfront_distribution" "prod" {
      + aliases                         = [
          + "set-of.com",
          + "www.set-of.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "set-of.com - API Gateway routing"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_200"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Name"         = "gateway-cloudfront-prod"
          + "cost_center"  = "engineering"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "gateway"
          + "service_name" = "gateway"
          + "team"         = "platform-team"
        }
      + tags_all                        = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Name"         = "gateway-cloudfront-prod"
          + "Project"      = "gateway"
          + "cost_center"  = "engineering"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "gateway"
          + "service_name" = "gateway"
          + "team"         = "platform-team"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true
        # (1 unchanged attribute hidden)

      + default_cache_behavior {
          + allowed_methods          = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id          = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = true
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = "216adef6-5c7f-47e4-b989-5492eafa07d3"
          + target_origin_id         = "frontend-alb"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "redirect-to-https"
        }

      + ordered_cache_behavior {
          + allowed_methods            = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id            = (known after apply)
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = false
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + origin_request_policy_id   = (known after apply)
          + path_pattern               = "/api/v1/*"
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "gateway-alb"
          + viewer_protocol_policy     = "https-only"
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "gateway-alb-prod-1837698569.ap-northeast-2.elb.amazonaws.com"
          + origin_id                = "gateway-alb"
            # (2 unchanged attributes hidden)

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "set-of.com"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "turbo-setof-web-lb-966736915.ap-northeast-2.elb.amazonaws.com"
          + origin_id                = "frontend-alb"
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:646886795421:certificate/24ad1686-0eb5-4ef0-9469-21cfb8cf683f"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_distribution.stage will be created
+ resource "aws_cloudfront_distribution" "stage" {
      + aliases                         = [
          + "stage.set-of.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "stage.set-of.com - API Gateway routing"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_200"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Name"         = "gateway-cloudfront-stage"
          + "cost_center"  = "engineering"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "gateway"
          + "service_name" = "gateway"
          + "team"         = "platform-team"
        }
      + tags_all                        = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Name"         = "gateway-cloudfront-stage"
          + "Project"      = "gateway"
          + "cost_center"  = "engineering"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "gateway"
          + "service_name" = "gateway"
          + "team"         = "platform-team"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true
        # (1 unchanged attribute hidden)

      + default_cache_behavior {
          + allowed_methods          = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id          = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = true
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = "216adef6-5c7f-47e4-b989-5492eafa07d3"
          + target_origin_id         = "frontend-alb"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "redirect-to-https"
        }

      + ordered_cache_behavior {
          + allowed_methods            = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id            = (known after apply)
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = false
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + origin_request_policy_id   = (known after apply)
          + path_pattern               = "/api/v1/*"
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "gateway-alb"
          + viewer_protocol_policy     = "https-only"
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "gateway-alb-prod-1837698569.ap-northeast-2.elb.amazonaws.com"
          + origin_id                = "gateway-alb"
            # (2 unchanged attributes hidden)

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "stage.set-of.com"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "turbo-setof-web-stage-364308525.ap-northeast-2.elb.amazonaws.com"
          + origin_id                = "frontend-alb"
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:646886795421:certificate/24ad1686-0eb5-4ef0-9469-21cfb8cf683f"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_origin_request_policy.api_all_viewer will be created
+ resource "aws_cloudfront_origin_request_policy" "api_all_viewer" {
      + arn     = (known after apply)
      + comment = "Forward all viewer headers for API requests"
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "gateway-api-all-viewer-prod"

      + cookies_config {
          + cookie_behavior = "all"
        }

      + headers_config {
          + header_behavior = "allViewerAndWhitelistCloudFront"

          + headers {
              + items = [
                  + "CloudFront-Forwarded-Proto",
                  + "CloudFront-Is-Mobile-Viewer",
                ]
            }
        }

      + query_strings_config {
          + query_string_behavior = "all"
        }
    }

  # aws_cloudfront_response_headers_policy.api_cors will be created
+ resource "aws_cloudfront_response_headers_policy" "api_cors" {
      + arn     = (known after apply)
      + comment = "CORS headers for API responses"
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "gateway-api-cors-prod"

      + cors_config {
          + access_control_allow_credentials = true
          + access_control_max_age_sec       = 86400
          + origin_override                  = false

          + access_control_allow_headers {
              + items = [
                  + "Accept",
                  + "Authorization",
                  + "Content-Type",
                  + "Origin",
                  + "X-Requested-With",
                ]
            }

          + access_control_allow_methods {
              + items = [
                  + "DELETE",
                  + "GET",
                  + "HEAD",
                  + "OPTIONS",
                  + "PATCH",
                  + "POST",
                  + "PUT",
                ]
            }

          + access_control_allow_origins {
              + items = [
                  + "https://set-of.com",
                  + "https://stage.set-of.com",
                  + "https://www.set-of.com",
                ]
            }
        }
    }

  # aws_route53_record.prod_apex will be created
+ resource "aws_route53_record" "prod_apex" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "set-of.com"
      + type            = "A"
      + zone_id         = (sensitive value)

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.prod_www will be created
+ resource "aws_route53_record" "prod_www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.set-of.com"
      + type            = "A"
      + zone_id         = (sensitive value)

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.stage will be created
+ resource "aws_route53_record" "stage" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "stage.set-of.com"
      + type            = "A"
      + zone_id         = (sensitive value)

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ api_cache_policy_id               = (known after apply)
+ api_cors_policy_id                = (known after apply)
+ api_origin_request_policy_id      = (known after apply)
+ prod_distribution_arn             = (known after apply)
+ prod_distribution_domain_name     = (known after apply)
+ prod_distribution_hosted_zone_id  = (known after apply)
+ prod_distribution_id              = (known after apply)
+ route53_records                   = {
      + prod_apex = (known after apply)
      + prod_www  = (known after apply)
      + stage     = (known after apply)
    }
+ routing_summary                   = {
      + production = {
          + api_origin      = "gateway-alb-prod-1837698569.ap-northeast-2.elb.amazonaws.com"
          + api_path        = "/api/v1/*"
          + domains         = [
              + "set-of.com",
              + "www.set-of.com",
            ]
          + frontend_origin = "turbo-setof-web-lb-966736915.ap-northeast-2.elb.amazonaws.com"
        }
      + staging    = {
          + api_origin      = "gateway-alb-prod-1837698569.ap-northeast-2.elb.amazonaws.com"
          + api_path        = "/api/v1/*"
          + domains         = [
              + "stage.set-of.com",
            ]
          + frontend_origin = "turbo-setof-web-stage-364308525.ap-northeast-2.elb.amazonaws.com"
        }
    }
+ stage_distribution_arn            = (known after apply)
+ stage_distribution_domain_name    = (known after apply)
+ stage_distribution_hosted_zone_id = (known after apply)
+ stage_distribution_id             = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/cloudfront
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FGateway%252Fterraform%252Fcloudfront%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/cloudfront
  ```
Plan: 8 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```